// m = a * b (행렬의 곱)
#include <stdio.h>
int main(void)
{
	int a[3][4] = { {1, 2, 3, 4}, {5, 6, 7, 8}, {9, 10, 11, 12} };	// a[3][4] 초기화
	int aa[3][4] = { {13, 14, 15, 16}, {17, 18, 19, 20}, {21, 22, 23, 24} };	// aa[3][4] 초기화
	int b[4][2] = { {1, 2}, {3, 4}, {5, 6}, {7, 8} };  // b[4][2] 초기화
	int t[4][3];
	int s[3][4];
	int m[3][2];

	int i, j, k;

	for(i = 0; i < 3; i++)
		for (j = 0; j < 2; j++) {
			m[i][j] = 0;
			for (k = 0; k < 4; k++)
				m[i][j] += a[i][k] * b[k][j];
		}
	for (i = 0; i < 3; i++) {
		for (j = 0; j < 2; j++)
			printf("%d\t", m[i][j]);
		printf("\n");
	}
	return 0;
}
