// s = a + aa (행렬의 합)
#include <stdio.h>
int main(void)
{
	int a[3][4] = { {1, 2, 3, 4}, {5, 6, 7, 8}, {9, 10, 11, 12} };	// a[3][4] 초기화
	int aa[3][4] = { {13, 14, 15, 16}, {17, 18, 19, 20}, {21, 22, 23, 24} };	// aa[3][4] 초기화
	int b[4][2] = { {1, 2}, {3, 4}, {5, 6}, {7, 8} };  // b[4][2] 초기화
	int t[4][3];
	int s[3][4];
	int m[3][2];

	int i, j;

	for (i = 0; i < 3; i++)		// 행 반복
		for (j = 0; j < 4; j++)		// 열 반복
			s[i][j] = a[i][j] + aa[i][j];	// a와 aa의 행의 합과 열의 합을 s[i][j]에 저장
	for (i = 0; i < 3; i++) {
		for (j = 0; j < 4; j++)
			printf("%d\t", s[i][j]);
		printf("\n");
	}
	return 0;
}
